{
  "books": [
    {
      "id": 1,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/06/28/16/preview/69e87e3223491fec6b50_400x.jpg",
      "title": "Masked Killer",
      "descr": "At night, two armed individuals broke into Walter Jallin's house - a robber and the police officer pursuing him. However, he is not unarmed either. The only problem is there's only one bullet, and the target must be chosen wisely.",
      "genre": "realism",
      "authorId": 1
    },
    {
      "id": 2,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/06/25/14/preview/cc51e6e00e4b07c43095_400x.jpg",
      "title": "Shop of Worlds",
      "descr": "Mr. Wayne reached the shop of worlds. In a conversation with the shopkeeper, he learned what he could get in exchange for his entire fortune - for the bundle he brought with him. The shopkeeper offered Wayne, with the help of an injection, to free his consciousness so that he could choose one of the countless worlds continuously generated by the Earth - a world of his dreams...",
      "genre": "science fiction",
      "authorId": 1
    },
    {
      "id": 3,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/06/23/15/preview/afb8c37c8c6117e24274_400x.jpg",
      "title": "Right to Die",
      "descr": "He died on the battlefield, and they resurrected him to send him back to the front line. It wasn't the first time. Again, the pain that even anesthesia couldn't dull. Living like this was impossible, but he had no right to die...",
      "genre": "science fiction",
      "authorId": 1
    },
    {
      "id": 4,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/06/28/15/preview/f76d05c44e989770888f_400x.jpg",
      "title": "Norman Wizdom and the Angel of Death",
      "descr": "Stanley Morrison, an ordinary, possibly even the best Hospital Assistant, really doesn't like it when someone doesn't know Norman Wisdom, the Little Man who won all our hearts.",
      "genre": "thriller",
      "authorId": 2
    },
    {
      "id": 5,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/03/22/09/preview/4d7fe3fda225b9021558_400x.jpg",
      "title": "Rune",
      "descr": "'Rune,' one of the most popular works of British master of criminal-mystical horror Christopher Fowler. The writer's creative style is characterized by the relevance of the theme, the convincingness of the created characters, as well as the originality and sharpness of the plots, combining elements of the tense detective-mystical plot and biting social satire.",
      "genre": "mysticism",
      "authorId": 2
    },
    {
      "id": 6,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/05/17/16/preview/4ce36fcf26e3be50c3d2_400x.jpg",
      "title": "Ridges of Madness",
      "descr": "A polar expedition encounters the unearthly horror of ancient times. The best nightmarishly beautiful and enchanting description in Lovecraft's works is captured in this masterpiece. It is the description of an abandoned ice city of the 'ancients,' leading into the depths of the earth.",
      "genre": "mysticism",
      "authorId": 3
    },
    {
      "id": 7,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/12/15/15/preview/977b0071402b5f013bc6_400x.jpg",
      "title": "Mound",
      "descr": "In 1928, an inquisitive ethnographer arrived in Oklahoma to conduct a comparative analysis of ghost stories circulating there with already known similar stories. It turned out that all the stories were mainly related to a single mound located in the western part of the state.",
      "genre": "mysticism",
      "authorId": 3
    },
    {
      "id": 8,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/03/30/21/preview/9678510160fc2d2ebe60_400x.jpg",
      "title": "Dagon",
      "descr": "Caught as a prisoner during the war, the hero of the story makes an escape and finds himself in the open ocean on a lifeboat. After exhausting and endless days of searching for land, waking up once again, he discovers that he is sinking in a viscous black swamp among the decomposed remains of fish and other nastiness...",
      "genre": "horror",
      "authorId": 3
    },
    {
      "id": 9,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/06/08/12/preview/109783f256f90c576123_400x.jpg",
      "title": "Chaospatron",
      "descr": "A strange incident at the traffic police post, when a battered farmer's 'UAZ' disintegrated into molecular dust along with the driver, turned out to be just a link in a long chain of unexplainable events that began almost thirty years ago in the jungles of Cambodia.",
      "genre": "science fiction",
      "authorId": 4
    },
    {
      "id": 10,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/03/22/09/preview/d4c0abc21e987981aa46_400x.jpg",
      "title": "Black Angel",
      "descr": "The Zone had never seen such a giant and powerful anomaly! It appeared suddenly, and no less unexpectedly, a whole army of its adepts also appeared - armed to the teeth and also calling themselves black angels. Mercenary Andrei Lunev, who undertook to lead two scientists to the center of the Zone, had to fight these very angels, and also - with former 'colleagues' and a multitude of stalkers hunting for the 'Joker' - a mysterious artifact rumored to give power over all mutants of the Zone...",
      "genre": "science fiction",
      "authorId": 4
    },
    {
      "id": 11,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/03/22/08/preview/62ca29212117b7bdec0c_400x.jpg",
      "title": "Countdown",
      "descr": "Stalker Andrei Lunev understood from the very beginning: something is wrong here... Officers of the International Inspection rushed to the center of Pripyat just a day before the next deadly emission, and by contract, Andrei had to cover their backs, and after completing the mysterious task of the inspectors - remove all outsiders who touched the secret of the Call.",
      "genre": "science fiction",
      "authorId": 4
    },
    {
      "id": 12,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/03/22/09/preview/7fd9b21db923b2ab7898_400x.jpg",
      "title": "Fifth Cosmic",
      "descr": "This war, named the Fifth Cosmic, had been ripening for a long time and started suddenly. Soldiers of the Earth Federation clashed in a bloody battle with the Democratic Alliance, led by Mars. But the flame of cosmic battles hid behind it the ominous figure of the Secret Advisor - a man (or a monster?) who, under the cover of fratricidal war, decided to become the ruler of the entire Galaxy.",
      "genre": "science fiction",
      "authorId": 4
    }
  ],
  "authors": [
    {
      "id": 1,
      "name": "Robert Sheckley"
    },
    {
      "id": 2,
      "name": "Christopher Fowler"
    },
    {
      "id": 3,
      "name": "H.P. Lovecraft"
    },
    {
      "id": 4,
      "name": "Vyacheslav Shalygin"
    }
  ]
}
